web/tutorials/precice/volume_coupled/fl1_2/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config-simple.xml";
participant Fluid1;

modules (FF);

interfaces
{
  Interface1
  {
    mesh      Fluid1-Mesh;
    patches   ();
    cellSets  (box1);
    locations volumeCenters;

    readData  ();
    writeData 
    (
      Velocity
      Alpha
    );
  };
};

FF
{
  nameU U;
  nameAlpha alpha.water;
};


