web/tutorials/precice/volume_coupled/fl1_2/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
       box (-1 -2 0) (0 0 5);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);
